// C 프로그래밍 - https://codereading101.github.io/C/
// 소스파일 - https://github.com/CodeReading101/C/blob/main/Chapter04/Operators.c

#include <stdio.h>
int main() {
	// 첫째 산술연산자 실습 및 출력
	printf( " 3 + 4 = %d\n", ( 3 + 4 ) );
	printf( " 5 - 3 = %d\n", ( 5 - 3 ) );
	printf( " 2 * 3 = %d\n", ( 2 * 3 ) );
	printf( "10 / 3 = %d\n", (10 / 3 ) );
	printf( "10 %% 3 = %d\n\n", (10 % 3 ) );
	// 둘째 비교연산자 실습 및 출력: 1(참), 0(거짓)
	printf( "5 == 5 = %d,   3 == 7 = %d\n", ( 5 == 5 ), ( 3 == 7 ) );
	printf( "9 != 2 = %d,   8 != 8 = %d\n", ( 9 != 2 ), ( 8 != 8 ) );
	printf( "4 <  5 = %d,   7 <  2 = %d\n", ( 4 < 5 ), ( 7 < 2 ) );
	printf( "7 >  2 = %d,   4 >  5 = %d\n", ( 7 > 2 ), ( 4 > 5 ) );
	printf( "4 <= 5 = %d,   7 <= 2 = %d\n", ( 4 <= 5 ), ( 7 <= 2 ) );
	printf( "7 >= 2 = %d,   4 >= 5 = %d\n\n", ( 7 >= 2 ), ( 4 >= 5 ) );
	// 셋째 논리연산자 실습 및 출력: 1(참), 0(거짓)
	printf( "  !0   = %d,	 !1   = %d\n", !0, !1 );
	printf( "0 && 0 = %d,   0 && 1 = %d,   1 && 0 = %d,   1 && 1 = %d\n", ( 0 && 0 ), ( 0 && 1 ), ( 1 && 0 ), ( 1 && 1 ) );
	printf( "0 || 0 = %d,   0 || 1 = %d,   1 || 0 = %d,   1 || 1 = %d\n", ( 0 || 0 ), ( 0 || 1 ), ( 1 || 0 ), ( 1 || 1 ) );
	return 0;
}

